In [5]:
import pandas as pd

In [1]:
!pip install pymysql

Collecting pymysql
  Downloading PyMySQL-0.9.3-py2.py3-none-any.whl (47 kB)
Installing collected packages: pymysql
Successfully installed pymysql-0.9.3

In [2]:
import pymysql as sql

In [3]:
con=sql.connect(host="localhost",user='root',password='Swapna@22',database='db')

In [6]:
df=pd.read_sql_query('select * from student',con)

In [7]:
df

   id name  marks
0   1  abs     60
1   2  pqr     80
2   3  xyz     75

In [8]:
df.to_csv('csvdata.csv')

In [9]:
df.to_json('jsondata.json')

In [15]:
dataframe=pd.read_json('jsondata.json')

In [16]:
dataframe

   id name  marks
0   1  abs     60
1   2  pqr     80
2   3  xyz     75